Revit 2024 API
City.Name Property
The name of the city
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Name { get; }
Visual Basic
Public ReadOnly Property Name As String
	Get
Visual C++
public:
property String^ Name {
	String^ get ();
}
Remarks
A read only string property that contains the name of the city, such as Boston.
See Also
City Class
Autodesk.Revit.DB Namespace